Config/InformationRegisters/СрокиИсполненияИСуммыОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СрокиИсполненияИСуммыОбязательств</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвансПроцентом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсРасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьРасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоЗайму</Name>
					<Comment>Установленный договором займа процент за пользьвание займом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КазначейскоеСопровождение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОплатаВИностраннойВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаВРублях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОбязательства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПринятыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОбязательствИСведенийПоДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обязательство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыПринятыхОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПринятыхОбязательств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоеОбязательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоеОбязательствоУчетПредмета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаИзменениеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаИзменениеОбязательстваУчетПредмета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПеререгистрациюОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринимаемоеОбязательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоеОбязательствоКонкурсныеПроцедуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтДоговораКонкурсныеПроцедуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринимаемоеОбязательствоИзменения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринимаемоеОбязательствоПеререгистрация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/CommonModules/РаботаСОбязательствамиВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция СформироватьСтруктуруДляПечати0531702(МассивДокументов) Экспорт
	
	МассивСтруктурДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Представление КАК Наименование,
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Ссылка КАК Документ,
	               |	ВЫБОР
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ПометкаУдаления
	               |			ТОГДА ИСТИНА
	               |		КОГДА (НЕ РегистрацияОбязательствИСведенийПоДоговорам.Проведен)
	               |			ТОГДА ИСТИНА
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательства)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательстваУчетПредмета)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ошибка,
	               |	ВЫБОР
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ПометкаУдаления
	               |			ТОГДА ""- документ """"_Документ_"""" помечен на удаление""
	               |		КОГДА (НЕ РегистрацияОбязательствИСведенийПоДоговорам.Проведен)
	               |			ТОГДА ""- документ """"_Документ_"""" не проведен""
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательства)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательстваУчетПредмета)
	               |			ТОГДА ""- документ """"_Документ_"""" типа: Форма 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)""
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	               |			ТОГДА ""- документ """"_Документ_"""" типа: Форма 0531706 (Заявка на перерегистрацию бюджетного обязательства)""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ТекстОшибки,
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Номер,
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Дата
	               |ИЗ
	               |	Документ.РегистрацияОбязательствИСведенийПоДоговорам КАК РегистрацияОбязательствИСведенийПоДоговорам
	               |ГДЕ
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Ссылка В(&МассивДокументов)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДляПечати = Новый Структура("Наименование, Документ, Ошибка, ТекстОшибки");
		ЗаполнитьЗначенияСвойств(СтруктураДляПечати, Выборка);
		МассивСтруктурДляПечати.Добавить(СтруктураДляПечати);
	КонецЦикла; 
	
	Возврат МассивСтруктурДляПечати;
	
КонецФункции

Функция СформироватьСтруктуруДляПечати0531702ПоДоговорам(МассивДоговоров) Экспорт
	
	МассивСтруктурДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Договоры.Ссылка КАК Договор,
	               |	ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) КАК Документ,
	               |	ВЫБОР
	               |		КОГДА Договоры.ПометкаУдаления
	               |			ТОГДА ИСТИНА
	               |		КОГДА ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ИСТИНА
	               |		КОГДА СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательства)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательстваУчетПредмета)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ошибка,
	               |	ВЫБОР
	               |		КОГДА Договоры.ПометкаУдаления
	               |			ТОГДА ""- договор """"_Договор_"""" помечен на удаление""
	               |		КОГДА ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ""- по договору """"_Договор_"""" не найден документ, регистрирующий обязательство""
	               |		КОГДА СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательства)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательстваУчетПредмета)
	               |			ТОГДА ""- по договору """"_Договор_"""" текущий документ: Форма 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)""
	               |		КОГДА СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	               |			ТОГДА ""- по договору """"_Договор_"""" текущий документ: Форма 0531706 (Заявка на перерегистрацию бюджетного обязательства)""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ТекстОшибки,
	               |	Договоры.Наименование
	               |ИЗ
	               |	Справочник.Договоры КАК Договоры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(
	               |				,
	               |				Регистратор ССЫЛКА Документ.РегистрацияОбязательствИСведенийПоДоговорам
	               |					И Обязательство В (&МассивДоговоров)) КАК СрокиСуммыСрезПоследних
	               |		ПО Договоры.Ссылка = СрокиСуммыСрезПоследних.Обязательство
	               |ГДЕ
	               |	Договоры.Ссылка В(&МассивДоговоров)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДляПечати = Новый Структура("Договор, Наименование, Документ, Ошибка, ТекстОшибки");
		ЗаполнитьЗначенияСвойств(СтруктураДляПечати, Выборка);
		МассивСтруктурДляПечати.Добавить(СтруктураДляПечати);
	КонецЦикла; 
	
	Возврат МассивСтруктурДляПечати;
	
КонецФункции

Функция СформироватьСтруктуруДляПечати0531705(МассивДокументов) Экспорт
	
	МассивСтруктурДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Представление КАК Наименование,
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Ссылка КАК Документ,
	               |	ВЫБОР
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ПометкаУдаления
	               |			ТОГДА ИСТИНА
	               |		КОГДА (НЕ РегистрацияОбязательствИСведенийПоДоговорам.Проведен)
	               |			ТОГДА ИСТИНА
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательство)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательствоУчетПредмета)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ошибка,
	               |	ВЫБОР
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ПометкаУдаления
	               |			ТОГДА ""- документ """"_Документ_"""" помечен на удаление""
	               |		КОГДА (НЕ РегистрацияОбязательствИСведенийПоДоговорам.Проведен)
	               |			ТОГДА ""- документ """"_Документ_"""" не проведен""
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательство)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательствоУчетПредмета)
	               |			ТОГДА ""- документ """"_Документ_"""" типа: Форма 0531702 (Сведения о принятом бюджетном обязательстве)""
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	               |			ТОГДА ""- документ """"_Документ_"""" типа: Форма 0531706 (Заявка на перерегистрацию бюджетного обязательства)""
	               |	КОНЕЦ КАК ТекстОшибки
	               |ИЗ
	               |	Документ.РегистрацияОбязательствИСведенийПоДоговорам КАК РегистрацияОбязательствИСведенийПоДоговорам
	               |ГДЕ
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Ссылка В(&МассивДокументов)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДляПечати = Новый Структура("Наименование, Документ, Ошибка, ТекстОшибки");
		ЗаполнитьЗначенияСвойств(СтруктураДляПечати, Выборка);
		МассивСтруктурДляПечати.Добавить(СтруктураДляПечати);
	КонецЦикла; 
	
	Возврат МассивСтруктурДляПечати;
	
КонецФункции

Функция СформироватьСтруктуруДляПечати0531705ПоДоговорам(МассивДоговоров) Экспорт
	
	МассивСтруктурДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Договоры.Ссылка КАК Договор,
	               |	ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) КАК Документ,
	               |	ВЫБОР
	               |		КОГДА Договоры.ПометкаУдаления
	               |			ТОГДА ИСТИНА
	               |		КОГДА ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ИСТИНА
	               |		КОГДА СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательство)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательствоУчетПредмета)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ошибка,
	               |	ВЫБОР
	               |		КОГДА Договоры.ПометкаУдаления
	               |			ТОГДА ""- договор """"_Договор_"""" помечен на удаление""
	               |		КОГДА ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ""- по договору """"_Договор_"""" не найден документ, регистрирующий обязательство""
	               |		КОГДА СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательство)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательствоУчетПредмета)
	               |			ТОГДА ""- по договору """"_Договор_"""" текущий документ: Форма 0531702 (Сведения о принятом бюджетном обязательстве)""
	               |		КОГДА СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	               |			ТОГДА ""- документ """"_Документ_"""" типа: Форма 0531706 (Заявка на перерегистрацию бюджетного обязательства)""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ТекстОшибки,
	               |	Договоры.Наименование
	               |ИЗ
	               |	Справочник.Договоры КАК Договоры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(
	               |				,
	               |				Регистратор ССЫЛКА Документ.РегистрацияОбязательствИСведенийПоДоговорам
	               |					И Обязательство В (&МассивДоговоров)) КАК СрокиСуммыСрезПоследних
	               |		ПО Договоры.Ссылка = СрокиСуммыСрезПоследних.Обязательство
	               |ГДЕ
	               |	Договоры.Ссылка В(&МассивДоговоров)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДляПечати = Новый Структура("Договор, Наименование, Документ, Ошибка, ТекстОшибки");
		ЗаполнитьЗначенияСвойств(СтруктураДляПечати, Выборка);
		МассивСтруктурДляПечати.Добавить(СтруктураДляПечати);
	КонецЦикла; 
	
	Возврат МассивСтруктурДляПечати;
	
КонецФункции

Функция СформироватьСтруктуруДляПечати0531706(МассивДокументов) Экспорт
	
	МассивСтруктурДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Представление КАК Наименование,
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Ссылка КАК Документ,
	               |	ВЫБОР
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ПометкаУдаления
	               |			ТОГДА ИСТИНА
	               |		КОГДА (НЕ РегистрацияОбязательствИСведенийПоДоговорам.Проведен)
	               |			ТОГДА ИСТИНА
	               |		КОГДА (НЕ(РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |					ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)))
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ошибка,
	               |	ВЫБОР
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ПометкаУдаления
	               |			ТОГДА ""- документ """"_Документ_"""" помечен на удаление""
	               |		КОГДА (НЕ РегистрацияОбязательствИСведенийПоДоговорам.Проведен)
	               |			ТОГДА ""- документ """"_Документ_"""" не проведен""
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательство)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательствоУчетПредмета)
	               |			ТОГДА ""- документ """"_Документ_"""" типа: Форма 0531702 (Сведения о принятом бюджетном обязательстве)""
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательства)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательстваУчетПредмета)
	               |			ТОГДА ""- документ """"_Документ_"""" типа: Форма 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)""
	               |	КОНЕЦ КАК ТекстОшибки
	               |ИЗ
	               |	Документ.РегистрацияОбязательствИСведенийПоДоговорам КАК РегистрацияОбязательствИСведенийПоДоговорам
	               |ГДЕ
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Ссылка В(&МассивДокументов)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДляПечати = Новый Структура("Наименование, Документ, Ошибка, ТекстОшибки");
		ЗаполнитьЗначенияСвойств(СтруктураДляПечати, Выборка);
		МассивСтруктурДляПечати.Добавить(СтруктураДляПечати);
	КонецЦикла; 
	
	Возврат МассивСтруктурДляПечати;
	
КонецФункции

Функция СформироватьСтруктуруДляПечати0531706ПоДоговорам(МассивДоговоров) Экспорт
	
	МассивСтруктурДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Договоры.Ссылка КАК Договор,
	               |	ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) КАК Документ,
	               |	ВЫБОР
	               |		КОГДА Договоры.ПометкаУдаления
	               |			ТОГДА ИСТИНА
	               |		КОГДА ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ИСТИНА
	               |		КОГДА (НЕ(СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |					ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)))
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ошибка,
	               |	ВЫБОР
	               |		КОГДА Договоры.ПометкаУдаления
	               |			ТОГДА ""- договор """"_Договор_"""" помечен на удаление""
	               |		КОГДА ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ""- по договору """"_Договор_"""" не найден документ, регистрирующий обязательство""
	               |		КОГДА СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательство)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательствоУчетПредмета)
	               |			ТОГДА ""- по договору """"_Договор_"""" текущий документ: Форма 0531702 (Сведения о принятом бюджетном обязательстве)""
	               |		КОГДА СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательства)
	               |				ИЛИ СрокиСуммыСрезПоследних.Регистратор.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательстваУчетПредмета)
	               |			ТОГДА ""- по договору """"_Договор_"""" текущий документ: 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ТекстОшибки,
	               |	Договоры.Наименование
	               |ИЗ
	               |	Справочник.Договоры КАК Договоры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(
	               |				,
	               |				Регистратор ССЫЛКА Документ.РегистрацияОбязательствИСведенийПоДоговорам
	               |					И Обязательство В (&МассивДоговоров)) КАК СрокиСуммыСрезПоследних
	               |		ПО Договоры.Ссылка = СрокиСуммыСрезПоследних.Обязательство
	               |ГДЕ
	               |	Договоры.Ссылка В(&МассивДоговоров)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДляПечати = Новый Структура("Договор, Наименование, Документ, Ошибка, ТекстОшибки");
		ЗаполнитьЗначенияСвойств(СтруктураДляПечати, Выборка);
		МассивСтруктурДляПечати.Добавить(СтруктураДляПечати);
	КонецЦикла; 
	
	Возврат МассивСтруктурДляПечати;
	
КонецФункции

Функция СформироватьСтруктуруДляПечатиСведенийОГК(МассивДокументов) Экспорт
	
	МассивСтруктурДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Представление КАК Наименование,
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Ссылка КАК Документ,
	               |	ВЫБОР
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ПометкаУдаления
	               |			ТОГДА ИСТИНА
	               |		КОГДА (НЕ РегистрацияОбязательствИСведенийПоДоговорам.Проведен)
	               |			ТОГДА ИСТИНА
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательство)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ошибка,
	               |	ВЫБОР
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ПометкаУдаления
	               |			ТОГДА ""- документ """"_Документ_"""" помечен на удаление""
	               |		КОГДА (НЕ РегистрацияОбязательствИСведенийПоДоговорам.Проведен)
	               |			ТОГДА ""- документ """"_Документ_"""" не проведен""
	               |		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринятоеОбязательство)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	               |				ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	               |			ТОГДА ""- документ """"_Документ_"""" не регистрирует сведения о государственном контракте""
	               |	КОНЕЦ КАК ТекстОшибки
	               |ИЗ
	               |	Документ.РегистрацияОбязательствИСведенийПоДоговорам КАК РегистрацияОбязательствИСведенийПоДоговорам
	               |ГДЕ
	               |	РегистрацияОбязательствИСведенийПоДоговорам.Ссылка В(&МассивДокументов)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДляПечати = Новый Структура("Наименование, Документ, Ошибка, ТекстОшибки");
		ЗаполнитьЗначенияСвойств(СтруктураДляПечати, Выборка);
		МассивСтруктурДляПечати.Добавить(СтруктураДляПечати);
	КонецЦикла; 
	
	Возврат МассивСтруктурДляПечати;
	
КонецФункции

Функция СформироватьСтруктуруДляПечатиСведенийОГКПоДоговорам(МассивДоговоров) Экспорт
	
	МассивСтруктурДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Договоры.Ссылка КАК Договор,
	               |	ЕСТЬNULL(СрокиИсполненияИСуммыОбязательствСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) КАК Документ,
	               |	ВЫБОР
	               |		КОГДА Договоры.ПометкаУдаления
	               |			ТОГДА ИСТИНА
	               |		КОГДА (НЕ Договоры.УчетПредметаДоговора)
	               |			ТОГДА ИСТИНА
	               |		КОГДА ЕСТЬNULL(СрокиИсполненияИСуммыОбязательствСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ошибка,
	               |	ВЫБОР
	               |		КОГДА Договоры.ПометкаУдаления
	               |			ТОГДА ""- договор """"_Договор_"""" помечен на удаление""
	               |		КОГДА (НЕ Договоры.УчетПредметаДоговора)
	               |			ТОГДА ""- по договору """"_Договор_"""" не ведется учет по предметам контракта""
	               |		КОГДА ЕСТЬNULL(СрокиИсполненияИСуммыОбязательствСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ""- по договору """"_Договор_"""" не найден документ, регистрирующий сведения о контракте""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ТекстОшибки,
	               |	Договоры.Наименование
	               |ИЗ
	               |	Справочник.Договоры КАК Договоры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(
	               |				,
	               |				Регистратор ССЫЛКА Документ.РегистрацияОбязательствИСведенийПоДоговорам
	               |					И Обязательство В (&МассивДоговоров)) КАК СрокиИсполненияИСуммыОбязательствСрезПоследних
	               |		ПО (Договоры.УчетПредметаДоговора)
	               |			И Договоры.Ссылка = СрокиИсполненияИСуммыОбязательствСрезПоследних.Обязательство
	               |ГДЕ
	               |	Договоры.Ссылка В(&МассивДоговоров)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДляПечати = Новый Структура("Договор, Наименование, Документ, Ошибка, ТекстОшибки");
		ЗаполнитьЗначенияСвойств(СтруктураДляПечати, Выборка);
		МассивСтруктурДляПечати.Добавить(СтруктураДляПечати);
	КонецЦикла; 
	
	Возврат МассивСтруктурДляПечати;
	
КонецФункции

Функция СформироватьСтруктуруДляПечатиСведенийОПрекращенииПоДоговорам(МассивДоговоров) Экспорт
	
	МассивСтруктурДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ИсполнениеРасторжениеДоговора.Ссылка,
	               |	ИсполнениеРасторжениеДоговора.Договор
	               |ПОМЕСТИТЬ ДокументыИсполнения
	               |ИЗ
	               |	Документ.ИсполнениеРасторжениеДоговора КАК ИсполнениеРасторжениеДоговора
	               |ГДЕ
	               |	ИсполнениеРасторжениеДоговора.Проведен
	               |	И ИсполнениеРасторжениеДоговора.Договор В(&МассивДоговоров)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Договоры.Ссылка КАК Договор,
	               |	ВЫБОР
	               |		КОГДА Договоры.ПометкаУдаления
	               |			ТОГДА ИСТИНА
	               |		КОГДА (НЕ Договоры.УчетПредметаДоговора)
	               |			ТОГДА ИСТИНА
	               |		КОГДА ДокументыИсполнения.Ссылка ЕСТЬ NULL 
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Ошибка,
	               |	ВЫБОР
	               |		КОГДА Договоры.ПометкаУдаления
	               |			ТОГДА ""- договор """"_Договор_"""" помечен на удаление""
	               |		КОГДА (НЕ Договоры.УчетПредметаДоговора)
	               |			ТОГДА ""- по договору """"_Договор_"""" не ведется учет по предметам контракта""
	               |		КОГДА ДокументыИсполнения.Ссылка ЕСТЬ NULL 
	               |			ТОГДА ""- по договору """"_Договор_"""" не найдено документов исполнения""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ТекстОшибки,
	               |	Договоры.Наименование,
	               |	ДокументыИсполнения.Ссылка КАК Документ
	               |ИЗ
	               |	Справочник.Договоры КАК Договоры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыИсполнения КАК ДокументыИсполнения
	               |		ПО Договоры.Ссылка = ДокументыИсполнения.Договор
	               |ГДЕ
	               |	Договоры.Ссылка В(&МассивДоговоров)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДляПечати = Новый Структура("Договор, Наименование, Документ, Ошибка, ТекстОшибки");
		ЗаполнитьЗначенияСвойств(СтруктураДляПечати, Выборка);
		МассивСтруктурДляПечати.Добавить(СтруктураДляПечати);
	КонецЦикла; 
	
	Возврат МассивСтруктурДляПечати;
	
КонецФункции

Функция СформироватьСтруктуруДляПечати0506101(МассивДокументов) Экспорт
	
	МассивСтруктурДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	РегистрацияОбязательствИСведенийПоДоговорам.Представление КАК Наименование,
	|	РегистрацияОбязательствИСведенийПоДоговорам.Ссылка КАК Документ,
	|	ВЫБОР
	|		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ПометкаУдаления
	|			ТОГДА ИСТИНА
	|		КОГДА (НЕ РегистрацияОбязательствИСведенийПоДоговорам.Проведен)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Ошибка,
	|	ВЫБОР
	|		КОГДА РегистрацияОбязательствИСведенийПоДоговорам.ПометкаУдаления
	|			ТОГДА ""- документ """"_Документ_"""" помечен на удаление""
	|		КОГДА (НЕ РегистрацияОбязательствИСведенийПоДоговорам.Проведен)
	|			ТОГДА ""- документ """"_Документ_"""" не проведен""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТекстОшибки,
	|	РегистрацияОбязательствИСведенийПоДоговорам.Номер,
	|	РегистрацияОбязательствИСведенийПоДоговорам.Дата
	|ИЗ
	|	Документ.РегистрацияОбязательствИСведенийПоДоговорам КАК РегистрацияОбязательствИСведенийПоДоговорам
	|ГДЕ
	|	РегистрацияОбязательствИСведенийПоДоговорам.Ссылка В(&МассивДокументов)";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДляПечати = Новый Структура("Наименование, Документ, Ошибка, ТекстОшибки");
		ЗаполнитьЗначенияСвойств(СтруктураДляПечати, Выборка);
		МассивСтруктурДляПечати.Добавить(СтруктураДляПечати);
	КонецЦикла; 
	
	Возврат МассивСтруктурДляПечати;
	
КонецФункции

Функция СформироватьСтруктуруДляПечати0506101ПоДоговорам(МассивДоговоров) Экспорт
	
	МассивСтруктурДляПечати = Новый Массив;
	
	Запрос = Новый Запрос;	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Договоры.Ссылка КАК Договор,
	|	ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) КАК Документ,
	|	ВЫБОР
	|		КОГДА Договоры.ПометкаУдаления
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Ошибка,
	|	ВЫБОР
	|		КОГДА Договоры.ПометкаУдаления
	|			ТОГДА ""- договор """"_Договор_"""" помечен на удаление""
	|		КОГДА ЕСТЬNULL(СрокиСуммыСрезПоследних.Регистратор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|			ТОГДА ""- по договору """"_Договор_"""" не найден документ, регистрирующий обязательство""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТекстОшибки,
	|	Договоры.Наименование
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(
	|				,
	|				Регистратор ССЫЛКА Документ.РегистрацияОбязательствИСведенийПоДоговорам
	|					И Обязательство В (&МассивДоговоров)) КАК СрокиСуммыСрезПоследних
	|		ПО Договоры.Ссылка = СрокиСуммыСрезПоследних.Обязательство
	|ГДЕ
	|	Договоры.Ссылка В(&МассивДоговоров)";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураДляПечати = Новый Структура("Договор, Наименование, Документ, Ошибка, ТекстОшибки");
		ЗаполнитьЗначенияСвойств(СтруктураДляПечати, Выборка);
		МассивСтруктурДляПечати.Добавить(СтруктураДляПечати);
	КонецЦикла; 
	
	Возврат МассивСтруктурДляПечати;
	
КонецФункции

#КонецОбласти
